MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18856/mcu.h
extern volatile ADACQbits_t ADACQbits __at(0x09D);
// bitfield macros
#define _ADACQ_ADACQ_POSN                                   0x0
#define _ADACQ_ADACQ_POSITION                               0x0
#define _ADACQ_ADACQ_SIZE                                   0x8
#define _ADACQ_ADACQ_LENGTH                                 0x8
#define _ADACQ_ADACQ_MASK                                   0xFF
#define _ADACQ_ADACQ0_POSN                                  0x0
#define _ADACQ_ADACQ0_POSITION                              0x0
#define _ADACQ_ADACQ0_SIZE                                  0x1
#define _ADACQ_ADACQ0_LENGTH                                0x1
#define _ADACQ_ADACQ0_MASK                                  0x1
#define _ADACQ_ADACQ1_POSN                                  0x1
#define _ADACQ_ADACQ1_POSITION                              0x1
#define _ADACQ_ADACQ1_SIZE                                  0x1
#define _ADACQ_ADACQ1_LENGTH                                0x1
#define _ADACQ_ADACQ1_MASK                                  0x2
#define _ADACQ_ADACQ2_POSN                                  0x2
#define _ADACQ_ADACQ2_POSITION                              0x2
#define _ADACQ_ADACQ2_SIZE                                  0x1
#define _ADACQ_ADACQ2_LENGTH                                0x1
#define _ADACQ_ADACQ2_MASK                                  0x4
#define _ADACQ_ADACQ3_POSN                                  0x3
#define _ADACQ_ADACQ3_POSITION                              0x3
#define _ADACQ_ADACQ3_SIZE                                  0x1
#define _ADACQ_ADACQ3_LENGTH                                0x1
#define _ADACQ_ADACQ3_MASK                                  0x8
#define _ADACQ_ADACQ4_POSN                                  0x4
#define _ADACQ_ADACQ4_POSITION                              0x4
#define _ADACQ_ADACQ4_SIZE                                  0x1
#define _ADACQ_ADACQ4_LENGTH                                0x1
#define _ADACQ_ADACQ4_MASK                                  0x10
#define _ADACQ_ADACQ5_POSN                                  0x5
#define _ADACQ_ADACQ5_POSITION                              0x5
#define _ADACQ_ADACQ5_SIZE                                  0x1
#define _ADACQ_ADACQ5_LENGTH                                0x1
#define _ADACQ_ADACQ5_MASK                                  0x20
#define _ADACQ_ADACQ6_POSN                                  0x6
#define _ADACQ_ADACQ6_POSITION                              0x6
#define _ADACQ_ADACQ6_SIZE                                  0x1
#define _ADACQ_ADACQ6_LENGTH                                0x1
#define _ADACQ_ADACQ6_MASK                                  0x40
#define _ADACQ_ADACQ7_POSN                                  0x7
#define _ADACQ_ADACQ7_POSITION                              0x7
#define _ADACQ_ADACQ7_SIZE                                  0x1
#define _ADACQ_ADACQ7_LENGTH                                0x1
#define _ADACQ_ADACQ7_MASK                                  0x80

// Register: ADPCH
#define ADPCH ADPCH
extern volatile unsigned char           ADPCH               __at(0x09E);
#ifndef _LIB_BUILD
asm("ADPCH equ 09Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPCH                  :6;
    };
    struct {
        unsigned ADPCH0                 :1;
        unsigned ADPCH1                 :1;
        unsigned ADPCH2                 :1;
        unsigned ADPCH3                 :1;
        unsigned ADPCH4                 :1;
        unsigned ADPCH5                 :1;
    };
} ADPCHbits_t;
extern volatile ADPCHbits_t ADPCHbits __at(0x09E);
// bitfield macros
#define _ADPCH_ADPCH_POSN                                   0x0
#define _ADPCH_ADPCH_POSITION                               0x0
#define _ADPCH_ADPCH_SIZE                                   0x6
#define _ADPCH_ADPCH_LENGTH                                 0x6
#define _ADPCH_ADPCH_MASK                                   0x3F
#define _ADPCH_ADPCH0_POSN                                  0x0
#define _ADPCH_ADPCH0_POSITION                              0x0
#define _ADPCH_ADPCH0_SIZE                                  0x1
#define _ADPCH_ADPCH0_LENGTH                                0x1
#define _ADPCH_ADPCH0_MASK                                  0x1
#define _ADPCH_ADPCH1_POSN                                  0x1
#define _ADPCH_ADPCH1_POSITION                              0x1
#define _ADPCH_ADPCH1_SIZE                                  0x1
#define _ADPCH_ADPCH1_LENGTH                                0x1
#define _ADPCH_ADPCH1_MASK                                  0x2
#define _ADPCH_ADPCH2_POSN                                  0x2
#define _ADPCH_ADPCH2_POSITION                              0x2
#define _ADPCH_ADPCH2_SIZE                                  0x1
#define _ADPCH_ADPCH2_LENGTH                                0x1
#define _ADPCH_ADPCH2_MASK                                  0x4
#define _ADPCH_ADPCH3_POSN                                  0x3
#define _ADPCH_ADPCH3_POSITION                              0x3
#define _ADPCH_ADPCH3_SIZE                                  0x1
#define _ADPCH_ADPCH3_LENGTH                                0x1
#define _ADPCH_ADPCH3_MASK                                  0x8
#define _ADPCH_ADPCH4_POSN                                  0x4
#define _ADPCH_ADPCH4_POSITION                              0x4
#define _ADPCH_ADPCH4_SIZE                                  0x1
#define _ADPCH_ADPCH4_LENGTH                                0x1
#define _ADPCH_ADPCH4_MASK                                  0x10
#define _ADPCH_ADPCH5_POSN                                  0x5
#define _ADPCH_ADPCH5_POSITION                              0x5
#define _ADPCH_ADPCH5_SIZE                                  0x1
#define _ADPCH_ADPCH5_LENGTH                                0x1
#define _ADPCH_ADPCH5_MASK                                  0x20

// Register: ADCNT
#define ADCNT ADCNT
extern volatile unsigned char           ADCNT               __at(0x10C);
#ifndef _LIB_BUILD
asm("ADCNT equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCNT                  :8;
    };
    struct {
        unsigned ADCNT0                 :1;
        unsigned ADCNT1                 :1;
        unsigned ADCNT2                 :1;
        unsigned ADCNT3                 :1;
        unsigned ADCNT4                 :1;
        unsigned ADCNT5                 :1;
        unsigned ADCNT6                 :1;
        unsigned ADCNT7                 :1;
    };
} ADCNTbits_t;
extern volatile ADCNTbits_t ADCNTbits __at(0x10C);
// bitfield macros
#define _ADCNT_ADCNT_POSN                                   0x0
#define _ADCNT_ADCNT_POSITION                               0x0
#define _ADCNT_ADCNT_SIZE                                   0x8
#define _ADCNT_ADCNT_LENGTH                                 0x8
#define _ADCNT_ADCNT_MASK                                   0xFF
#define _ADCNT_ADCNT0_POSN                                  0x0
#define _ADCNT_ADCNT0_POSITION                              0x0
#define _ADCNT_ADCNT0_SIZE                                  0x1
#define _ADCNT_ADCNT0_LENGTH                                0x1
#define _ADCNT_ADCNT0_MASK                                  0x1
#define _ADCNT_ADCNT1_POSN                                  0x1
#define _ADCNT_ADCNT1_POSITION                              0x1
#define _ADCNT_ADCNT1_SIZE                                  0x1
#define _ADCNT_ADCNT1_LENGTH                                0x1
#define _ADCNT_ADCNT1_MASK                                  0x2
#define _ADCNT_ADCNT2_POSN                                  0x2
#define _ADCNT_ADCNT2_POSITION                              0x2
#define _ADCNT_ADCNT2_SIZE                                  0x1
#define _ADCNT_ADCNT2_LENGTH                                0x1
#define _ADCNT_ADCNT2_MASK                                  0x4
#define _ADCNT_ADCNT3_POSN                                  0x3
#define _ADCNT_ADCNT3_POSITION                              0x3
#define _ADCNT_ADCNT3_SIZE                                  0x1
#define _ADCNT_ADCNT3_LENGTH                                0x1
#define _ADCNT_ADCNT3_MASK                                  0x8
#define _ADCNT_ADCNT4_POSN                                  0x4
#define _ADCNT_ADCNT4_POSITION                              0x4
#define _ADCNT_ADCNT4_SIZE                                  0x1
#define _ADCNT_ADCNT4_LENGTH                                0x1
#define _ADCNT_ADCNT4_MASK                                  0x10
#define _ADCNT_ADCNT5_POSN                                  0x5
#define _ADCNT_ADCNT5_POSITION                              0x5
#define _ADCNT_ADCNT5_SIZE                                  0x1
#define _ADCNT_ADCNT5_LENGTH                                0x1
#define _ADCNT_ADCNT5_MASK                                  0x20
#define _ADCNT_ADCNT6_POSN                                  0x6
#define _ADCNT_ADCNT6_POSITION                              0x6
#define _ADCNT_ADCNT6_SIZE                                  0x1
#define _ADCNT_ADCNT6_LENGTH                                0x1
#define _ADCNT_ADCNT6_MASK                                  0x40
#define _ADCNT_ADCNT7_POSN                                  0x7
#define _ADCNT_ADCNT7_POSITION                              0x7
#define _ADCNT_ADCNT7_SIZE                                  0x1
#define _ADCNT_ADCNT7_LENGTH                                0x1
#define _ADCNT_ADCNT7_MASK                                  0x80

// Register: ADRPT
#define ADRPT ADRPT
extern volatile unsigned char           ADRPT               __at(0x10D);
#ifndef _LIB_BUILD
asm("ADRPT equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRPT                  :8;
    };
    struct {
        unsigned ADRPT0                 :1;
        unsigned ADRPT1                 :1;
        unsigned ADRPT2                 :1;
        unsigned ADRPT3                 :1;
        unsigned ADRPT4                 :1;
        unsigned ADRPT5                 :1;
        unsigned ADRPT6                 :1;
        unsigned ADRPT7                 :1;
    };
} ADRPTbits_t;
